In [2]:
import pandas as pd
import numpy as np

In [13]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                        'B': ['B0', 'B1', 'B2'],
                        'C': ['C0', 'C1', 'C2']}, index=[0, 1, 2])

In [15]:
df2 = pd.DataFrame({'A': ['A3', 'A4', 'A5'],
                        'B': ['B3', 'B4', 'B5'],
                        'C': ['C3', 'C4', 'C5']},
                         index=[3, 4, 5])

In [19]:
df3 = pd.DataFrame({'A': ['A6', 'A7', 'A8'],
                        'B': ['B6', 'B7', 'B8'],
                        'C': ['C6', 'C7', 'C8']},
                        index=[6,7,8])

In [20]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

## concat() function

`Docstring`: Concatenate pandas objects along a particular axis with optional set logic along the other axes.

In [21]:
pd.concat([df1,df2,df3])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A4  B4  C4
4  A5  B5  C5
5  A6  B6  C6
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [22]:
pd.concat([df1,df2,df3], axis=1)

     A    B    C    A    B    C    A    B    C
0   A0   B0   C0  NaN  NaN  NaN  NaN  NaN  NaN
1   A1   B1   C1  NaN  NaN  NaN  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN   A4   B4   C4  NaN  NaN  NaN
4  NaN  NaN  NaN   A5   B5   C5  NaN  NaN  NaN
5  NaN  NaN  NaN   A6   B6   C6  NaN  NaN  NaN
6  NaN  NaN  NaN  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8

## merge() function

`Docstring`: Merge DataFrame or named Series objects with a database-style join.

In [26]:
pd.merge(df1,df2)

Empty DataFrame
Columns: [A, B, C]
Index: []

In [27]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                     'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                          'C': ['C0', 'C1', 'C2'],
                          'D': ['D0', 'D1', 'D2']})

In [28]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2

In [29]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2

In [30]:
pd.merge(left,right, how="inner", on="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [31]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1'],
                     'key2': ['K0', 'K1', 'K0'],
                        'A': ['A0', 'A1', 'A2'],
                        'B': ['B0', 'B1', 'B2']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1'],
                               'key2': ['K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2'],
                                  'D': ['D0', 'D1', 'D2']})

In [32]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2

In [33]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2

In [34]:
pd.merge(left, right, on = "key1")

  key1 key2_x   A   B key2_y   C   D
0   K0     K0  A0  B0     K0  C0  D0
1   K0     K1  A1  B1     K0  C0  D0
2   K1     K0  A2  B2     K0  C1  D1
3   K1     K0  A2  B2     K0  C2  D2

In [35]:
pd.merge(left, right, on = ["key1", "key2"])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [36]:
pd.merge(left, right, how="inner", on = ["key1", "key2"])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [37]:
pd.merge(left, right, how="outer", on = ["key1", "key2"])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2

## join() function

In [38]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [39]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [40]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [41]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [42]:
left.join(right, how = "outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# self imposed exercises

# reminder

In [13]:
pd.Series([10,88,3,4,5])

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [20]:
label = ["a","b","c"]
my_data = [10,20,30]
arr = np.array(my_data)
d={"a":10, "b":20, "c":30}

In [21]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [22]:
pd.Series(data=my_data, index= label)

a    10
b    20
c    30
dtype: int64

In [23]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

# exercise go on

In [24]:
s1 = pd.Series(["a","b"])

In [25]:
s1

0    a
1    b
dtype: object

In [26]:
s2= pd.Series(["c","d"])

In [27]:
pd.concat([s1,s2])

0    a
1    b
0    c
1    d
dtype: object

In [28]:
pd.concat([s1,s2], ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [32]:
pd.concat([s1,s2], keys= ["s1","s2"])

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [33]:
pd.concat([s1,s2], keys= ["s1","s2"], names= ["Serie Name", "Row ID"])

Serie Name  Row ID
s1          0         a
            1         b
s2          0         c
            1         d
dtype: object

In [34]:
df1= pd.DataFrame([["a", 1], ["b", 2]], columns = ["letter", "number"])

In [35]:
df1

  letter  number
0      a       1
1      b       2

In [36]:
df2= pd.DataFrame([["c", 3], ["d", 4]], columns = ["letter", "number"])

In [37]:
df2

  letter  number
0      c       3
1      d       4

In [38]:
pd.concat([df1,df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [39]:
df3 = pd.DataFrame([["a", 3, "cat"], ["d", 4, "dog"]], columns = ["letter", "number", "animal"])

In [44]:
df3

  letter  number animal
0      a       3    cat
1      d       4    dog

In [47]:
pd.concat([df1, df3], sort=False)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      a       3    cat
1      d       4    dog

In [50]:
pd.concat([df1, df3], join="inner")

  letter  number
0      a       1
1      b       2
0      a       3
1      d       4

In [51]:
df4= pd.DataFrame([["bird", "polly"], ["monkey", "george"]], columns=["animal", "name"])

In [52]:
df4

   animal    name
0    bird   polly
1  monkey  george

In [53]:
pd.concat([df1,df4], axis =1)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

# merge

In [124]:
df1 = pd.DataFrame(data = {"lkey": ["foo", "bar", "baz", "foo"], "value": [1,2,3,4]})

In [125]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      4

In [126]:
df2= pd.DataFrame(data= {"rkey": ["foo", "bar", "baz", "foo"], "value": [5,6,7,8]})

In [127]:
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [128]:
df1.merge(df2, left_on="lkey", right_on="rkey")

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        4  foo        5
3  foo        4  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [132]:
pd.merge(df1,df2)

Empty DataFrame
Columns: [lkey, value, rkey]
Index: []

# self devised example

In [91]:
ab = pd.DataFrame({"letters": ["a", "b", "c"],
                 "numbers": [1,2,3]})

In [92]:
ab

  letters  numbers
0       a        1
1       b        2
2       c        3

In [93]:
cd = pd.DataFrame({"letters": ["a", "b", "c"],
                 "numbers": [4,5,6]})

In [94]:
cd

  letters  numbers
0       a        4
1       b        5
2       c        6

In [97]:
pd.merge(ab, cd, on="letters")

  letters  numbers_x  numbers_y
0       a          1          4
1       b          2          5
2       c          3          6

In [154]:
arr1 = np.array([[1,2,3], [4,5,6], [7,8,9], [10,11,12]])

In [155]:
arr1

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12]])

In [156]:
df1 = pd.DataFrame(data=arr1, columns= ["a", "b", "c"])

In [157]:
df1

    a   b   c
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [158]:
arr2 = np.array([[1,2,3], [4,5,6], [8,8,9], [11,11,12]])

In [159]:
df2 = pd.DataFrame(data=arr2, columns= ["a", "b", "c"])

In [160]:
df2

    a   b   c
0   1   2   3
1   4   5   6
2   8   8   9
3  11  11  12

In [161]:
pd.merge(df1, df2, on="a")

   a  b_x  c_x  b_y  c_y
0  1    2    3    2    3
1  4    5    6    5    6

In [176]:
df = pd.DataFrame({"key": ["K0", "K1", "K2", "K3", "K4", "K5"], 
                  "A": ["A0", "A1", "A2", "A3", "A4", "A5"]})

In [177]:
df

  key   A
0  K0  A0
1  K1  A1
2  K2  A2
3  K3  A3
4  K4  A4
5  K5  A5

In [178]:
other=pd.DataFrame({"key": ["K0", "K1", "K2"],
                   "B": ["B0", "B1", "B2"]})

In [180]:
other

  key   B
0  K0  B0
1  K1  B1
2  K2  B2

In [182]:
df.join(other, how="outer")

ValueError: columns overlap but no suffix specified: Index(['key'], dtype='object')